courses/specialist/уровень-4/модуль-5/sample_server_1/messages/sayHello-request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <req:sayHello xmlns:req="urn:SampleServer1">
		<userName>string</userName>
	</req:sayHello>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
